ka2_2024/src/Documents/РасчетКурсовыхРазниц/РасчетКурсовыхРазниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетКурсовыхРазниц</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваУПодотчетныхЛиц</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РезервыПоСомнительнымДолгам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоФинансовымИнструментамНУ</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваБезналичные</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВПути</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиНУ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиНУ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныеСредстваДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПроцентныеРасходыДисконтирования</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеДокументы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоФинансовымИнструментам</registerRecords>
  <registerRecords>InformationRegister.РасчетПереоценкиВалютныхСредствНУ</registerRecords>
  <registerRecords>AccumulationRegister.ИнвестицииВАренду</registerRecords>
  <registerRecords>AccumulationRegister.УслугиКОформлениюОтчетовПринципалу</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереоценкаПоДням</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ka2_2024/src/InformationRegisters/НастройкиУчетаНалогаНаПрибыль/НастройкиУчетаНалогаНаПрибыль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНалогаНаПрибыль</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ПорядокУплатыАвансовПоНалогуНаПрибыль</name>
    <type>
      <types>EnumRef.ПорядокУплатыАвансовПоНалогуНаПрибыль</types>
    </type>
  </resources>
  <resources>
    <name>БазаРаспределенияКосвенныхРасходовПоВидамДеятельности</name>
    <type>
      <types>EnumRef.БазыРаспределенияКосвенныхРасходовПоВидамДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгамНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРезервовПоСомнительнымДолгамНУ</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьВСоставНалоговыхРасходовАрендныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизацииНУ</name>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойВариантНалогообложенияПрибыли</name>
    <type>
      <types>CatalogRef.ВариантыНалогообложенияПрибыли</types>
    </type>
  </resources>
  <resources>
    <name>РаздельныйУчетПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательОпределенияДолиПрибыли</name>
    <type>
      <types>EnumRef.ПоказателиДляОпределенияДолиПрибыли</types>
    </type>
  </resources>
  <resources>
    <name>УплачиватьНалогПоГруппамОбособленныхПодразделений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНезависимогоПризнанияДоходовРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Documents/РасчетКурсовыхРазниц/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПереоценкаПоДням = Константы.ПереоцениватьВалютныеСредстваПоДням.Получить();
	КонецЕсли;
	
	СписокВыбора = Элементы.ХозяйственнаяОперация.СписокВыбора;
	ДенежныеСредстваСервер.УстановитьВидимостьОперацийПоДоговорамКредитовИДепозитов(Элементы.ХозяйственнаяОперация);
	
	//++ НЕ УТ
	Если ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА() Тогда
		ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов;
		ЭлементСписка = СписокВыбора.НайтиПоЗначению(ХозяйственнаяОперация);
		Если ЭлементСписка = Неопределено Тогда
			СписокВыбора.Добавить(ХозяйственнаяОперация, НСтр("ru = 'Финансовые инструменты'"));
		КонецЕсли;
	КонецЕсли;
	//++ Локализация
	УстановитьВидимостьКомандыПерезаполненияРегистровНУ();
	//-- Локализация
	
	//-- НЕ УТ
	
	// Контроль создания документа в подчиненном узле РИБ с фильтрами
	ОбменДаннымиУТУП.КонтрольСозданияДокументовВРаспределеннойИБ(Объект, Отказ);

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПереоценкаПоДням = ТекущийОбъект.ПереоценкаПоДням;
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ПереоценкаПоДням = ПереоценкаПоДням;
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	//++ НЕ УТ
	
	//++ Локализация
	УстановитьВидимостьКомандыПерезаполненияРегистровНУ();
	//-- Локализация
	
	//-- НЕ УТ
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьРегистрыНУ(Команда)
	//++ НЕ УТ
	
	//++ Локализация
	ШаблонВопроса = НСтр("ru = 'По организации %Организация% будут перезаполнены остатки и обороты 
		|в регистрах налогового учета по %расчетам% за период с %НачалоПериода% до %КонецПериода%.
		|После этого необходимо рассчитать курсовые разницы и закрыть периоды начиная с текущего.
		|Перезаполнение регистров не оказывает влияние на закрытие месяца.
		|Продолжить?'");
	
	ТекстВопроса = СтрЗаменить(ШаблонВопроса, "%Организация%", Объект.Организация);
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами") Тогда
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%расчетам%", НСтр("ru = 'расчетам с клиентами'"));
	ИначеЕсли Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками") Тогда
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%расчетам%", НСтр("ru = 'расчетам с поставщиками'"));
	ИначеЕсли Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов") Тогда
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%расчетам%", НСтр("ru = 'финансовым инструментам'"));
	ИначеЕсли Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде") Тогда
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%расчетам%", НСтр("ru = 'арендным расчетам'"));
	ИначеЕсли Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПереоценкаДенежныхСредств") Тогда
		ТекстВопроса = НСтр("ru = 'По организации %Организация% будет перезаполнен регистр сведений ""Расчет переоценки валютных средств НУ""
		|за период с %НачалоПериода% до %КонецПериода%.
		|После этого необходимо рассчитать курсовые разницы и закрыть периоды начиная с текущего.
		|Перезаполнение регистр не оказывает влияние на закрытие месяца.
		|Продолжить?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Организация%", Объект.Организация);
	КонецЕсли;
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%НачалоПериода%", Формат(Дата(2022,1,1), "ДЛФ=DD"));
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%КонецПериода%", Формат(НачалоМесяца(Объект.Дата), "ДЛФ=DD"));
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьРегистрыНУЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	//-- Локализация
	
	//-- НЕ УТ
	
	Возврат;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//++ НЕ УТ

//++ Локализация
&НаСервере
Процедура УстановитьВидимостьКомандыПерезаполненияРегистровНУ()
	
	Элементы.ФормаПерезаполнитьРегистрыНУ.Видимость = ПолучитьФункциональнуюОпцию("ЛокализацияРФ")
		И НЕ ПолучитьФункциональнуюОпцию("УправлениеТорговлей")
		И (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами
			ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками
			ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов
			ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде
			ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств)
		И Объект.Дата >= РегистрыСведений.НастройкиУчетаНалогаНаПрибыль.НачалоВступленияВСилу67ФЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьРегистрыНУЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьПерезаполнениеРегистровНУ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПерезаполнениеРегистровНУ()
	 
	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере()
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСКлиентами Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
					"ОперативныеВзаиморасчетыСервер.ПерезаполнитьОборотыНУ", Объект.Организация, Объект.Дата, Истина);
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовСПоставщиками Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
					"ОперативныеВзаиморасчетыСервер.ПерезаполнитьОборотыНУ", Объект.Организация, Объект.Дата, Ложь);
		
	ИначеЕсли (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаФинансовыхИнструментов
				ИЛИ Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаРасчетовПоАренде) Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
					"Документы.РасчетКурсовыхРазниц.ПерезаполнитьОборотыНУ", Объект.Организация, Объект.Дата, Объект.ХозяйственнаяОперация);
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
					"Документы.РасчетКурсовыхРазниц.ПерезаполнитьОборотыНУ", Объект.Организация, Объект.Дата, Объект.ХозяйственнаяОперация);
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереоценкаДенежныхСредств Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(,
					"Документы.РасчетКурсовыхРазниц.ПерезаполнитьРасшифровкуРасчетаНУДляДС", Объект.Организация, Объект.Дата);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.ПодробноеПредставлениеОшибки;
	КонецЕсли;
 
КонецПроцедуры
//-- Локализация

//-- НЕ УТ

#КонецОбласти
